//
// Created by 刘嘉俊 on 24-8-5.
//

#include "servo_arm.h"

//// 182 -2
////二维云台，中间90，右边0，左边180
////六轴塑料舵机机械臂
////0号位，中间90.右0，左180
////1号位，中间85.前平180，后卡60，设85为中间值，-5为机械补偿
////2号位，中间97.前平0，后平180，设97为中间值，+7为机械补偿
////3号位，中间82.前平180，后平0，设82为中间值，-8为机械补偿
////4号位，中间85.左180，右0，设85为中间值，-5为机械补偿
////5号位抓夹，173起始，90平，30底
//setAngle(0,90);
//HAL_Delay(20);
//setAngle(1,85);
//HAL_Delay(20);
//setAngle(2,97);
//HAL_Delay(20);
//setAngle(3,82);
//HAL_Delay(20);
//setAngle(4,85);
//HAL_Delay(20);
//setAngle(5,173);