//
// Created by 刘嘉俊 on 24-7-25.
//

#ifndef C8T6_BALANCE_PID_H
#define C8T6_BALANCE_PID_H
#include "robot_config.h"
/***************************************************************************
直立环PD控制器：Kp*Ek+Kd*Ek_D
入口：Med:机械中值(期望角度)，Angle:真实角度，gyro_Y:真实角速度
出口：PMW数值
******************************************************************************/
int Vertical(float Angle,float Gyro_Y);
/*********************************************************************
速度环PI控制器：Kp*Ek+Ki*Ek_S(Ek_S：偏差的积分)
入口：左右编码器测到的数值
出口：
**********************************************************************/
int Velocity(int Encoder_left,int Encoder_right);
/*********************************************************************
转向环：系数*Z轴角速度+系数*遥控数据
入口：左右电机编码器测得数值，Z轴角速度
**********************************************************************/
int Turn(int Encoder_Left,int Encoder_Right,float gyro);

void calculate(void);

#endif //C8T6_BALANCE_PID_H
